![title](./pic/renaming_combining/combining/concat/1_title.png)

In [1]:
import pandas as pd

In [4]:
names = pd.DataFrame({'Name': ['Tim', 'Klaus', 'Alfons', 'Hanna', 'Marie', 'Gerdtraud'], 
                      'Alter': ['21', '18', '42', '19', '20', '55']})
names

        Name Alter
0        Tim    21
1      Klaus    18
2     Alfons    42
3      Hanna    19
4      Marie    20
5  Gerdtraud    55

In [5]:
names_men = names[:3]
names_men

     Name Alter
0     Tim    21
1   Klaus    18
2  Alfons    42

In [9]:
names_women = names[3:]
names_women

        Name Alter
3      Hanna    19
4      Marie    20
5  Gerdtraud    55

Bei der Durchführung von Operationen mit einem Datensatz müssen wir manchmal verschiedene `DataFrames` und/oder `Series` auf nicht-triviale Weise kombinieren. `Pandas` hat drei Kernmethoden, um dies zu tun. In der Reihenfolge der zunehmenden Komplexität sind dies `.concat()`, `.join()` und `.merge()`. Das meiste von dem, was `.merge()` kann, kann  auch mit `.join()` gemacht werden, so dass wir es hier weglassen und uns auf die ersten beiden Funktionen konzentrieren werden. 

Das soll nicht heißen, dass `.merge()` unwichtig ist, im Gegenteil. Ich will hier erst die einfachen beiden besprechen, denn `.merge()` alleine ist so wichtig und kann alles was wir hier lernen ersetzen, dass es ein extra Kapitel bekommt.

---

## Combining: `.contact()`

![title](./pic/renaming_combining/combining/concat/2_concat.png)

> https://pandas.pydata.org/docs/reference/api/pandas.concat.html

Die einfachste Kombinationsmethode ist `concat()`. Bei einer Liste von Elementen fügt diese Funktion diese Elemente entlang einer Achse zusammen.

Dies ist nützlich, wenn wir Daten in verschiedenen `DataFrames`- oder `Series`-Objekten haben, die aber dieselben Felder (Spalten) aufweisen.

In [4]:
pd.concat([names_men, names_women])

        Name Alter
0        Tim    21
1      Klaus    18
2     Alfons    42
0      Hanna    19
1      Marie    20
2  Gerdtraud    55

---

## `.concat()` Parameter: `axis=`

Mit dem Argument `axis=` kannst du angeben, entlang welcher Achse die beiden `DataFrames` miteinander verbunden werden sollen. Verwendest du `axis=0`, werden die Zeilen untereinander zusammengefügt, also in vertikaler Ausrichtung...

In [5]:
pd.concat([names_men, names_women], axis=0)

        Name Alter
0        Tim    21
1      Klaus    18
2     Alfons    42
0      Hanna    19
1      Marie    20
2  Gerdtraud    55

...bei `axis=1`, werden bilden die Indexe sowie Values neue Spalten im resultierenden `DataFrame`, also in horizontaler Ausrichtung

In [6]:
pd.concat([names_men, names_women], axis=1)

     Name Alter       Name Alter
0     Tim    21      Hanna    19
1   Klaus    18      Marie    20
2  Alfons    42  Gerdtraud    55

In [7]:
cars = pd.DataFrame({'Car': ['BMW 320', 'VW Golf 6', 'Mini']})

In [8]:
pd.concat([names_men, cars], axis=1)

     Name Alter        Car
0     Tim    21    BMW 320
1   Klaus    18  VW Golf 6
2  Alfons    42       Mini

---

## `.concat()`  Parameter: `ignore_index=`

Auch ist das Argument `ignore_index=` hier wiederzufinden. Erneut setzt es bei `True` den Index zurück und bildet eine von 0 fortlaufende Nummerierung, während es bei `False` den Index des ursprünglichen `DataFrames` übernimmt.

In [9]:
pd.concat([names_men, names_women], ignore_index=False)

        Name Alter
0        Tim    21
1      Klaus    18
2     Alfons    42
0      Hanna    19
1      Marie    20
2  Gerdtraud    55

In [10]:
pd.concat([names_men, names_women], ignore_index=True)

        Name Alter
0        Tim    21
1      Klaus    18
2     Alfons    42
3      Hanna    19
4      Marie    20
5  Gerdtraud    55